import random
from datetime import datetime, timedelta


ITEM_NUM = 500

base_date = datetime(2024, 12, 1)

output_file = 'flight_data.txt'

cities = ["北京", "哈尔滨", "呼和浩特", "乌鲁木齐", "广州", "拉萨", "昆明", "成都", "上海", "南宁", "西安", "合肥", "伦敦", "东京",
          "悉尼", "莫斯科", "巴黎", "纽约", "柏林", "洛杉矶", "首尔", "曼谷"]

airlines_code = {
    "中国国际航空": "CA",
    "东方航空": "MU",
    "南方航空": "CZ",
    "海南航空": "HU",
    "全日空": "NH",
    "日本航空": "JL",
    "大韩航空": "KE",
    "英国航空": "BA",
    "法国航空": "AF",
    "汉莎航空": "LH",
    "美联航": "UA",
    "澳洲航空": "QF",
    "俄罗斯航空": "SU",
    "泰国航空": "TG"
}

airlines = {
    "中国国际航空": ["北京", "上海", "广州", "成都", "深圳", "昆明", "西安", "哈尔滨", "呼和浩特", "乌鲁木齐", "拉萨", "合肥"],
    "东方航空": ["上海", "北京", "广州", "昆明", "西安", "合肥", "成都", "南宁"],
    "南方航空": ["广州", "北京", "上海", "昆明", "成都", "南宁", "拉萨"],
    "海南航空": ["海口", "北京", "上海", "广州", "西安", "成都"],
    "日本航空": ["东京"],
    "大韩航空": ["首尔"],
    "英国航空": ["伦敦", "北京", "东京"],
    "法国航空": ["巴黎", "北京", "东京"],
    "汉莎航空": ["柏林", "法兰克福", "北京", "上海"],
    "美联航": ["纽约", "洛杉矶"],
    "澳洲航空": ["悉尼"],
    "俄罗斯航空": ["莫斯科"],
    "泰国航空": ["曼谷"]
}

common_aircraft = [
    "波音737",
    "空客A320",
    "波音777",
    "空客A330",
    "波音787",
    "空客A350",
]

city_distances = {
    ("北京", "哈尔滨"): 1100,
    ("北京", "呼和浩特"): 450,
    ("北京", "乌鲁木齐"): 2200,
    ("北京", "广州"): 2100,
    ("北京", "拉萨"): 2200,
    ("北京", "昆明"): 1900,
    ("北京", "成都"): 1500,
    ("北京", "上海"): 1100,
    ("北京", "南宁"): 2300,
    ("北京", "西安"): 900,
    ("北京", "合肥"): 1000,
    ("北京", "伦敦"): 8200,
    ("北京", "东京"): 2100,
    ("北京", "悉尼"): 9000,
    ("北京", "莫斯科"): 5800,
    ("北京", "巴黎"): 8400,
    ("北京", "纽约"): 11000,
    ("北京", "柏林"): 7500,
    ("北京", "洛杉矶"): 10000,
    ("北京", "首尔"): 950,
    ("北京", "曼谷"): 3300,
    ("哈尔滨", "呼和浩特"): 1300,
    ("哈尔滨", "乌鲁木齐"): 3300,
    ("哈尔滨", "广州"): 3200,
    ("哈尔滨", "拉萨"): 3300,
    ("哈尔滨", "昆明"): 3000,
    ("哈尔滨", "成都"): 2600,
    ("哈尔滨", "上海"): 2000,
    ("哈尔滨", "南宁"): 3400,
    ("哈尔滨", "西安"): 2000,
    ("哈尔滨", "合肥"): 2100,
    ("哈尔滨", "伦敦"): 7500,
    ("哈尔滨", "东京"): 1500,
    ("哈尔滨", "悉尼"): 9500,
    ("哈尔滨", "莫斯科"): 5200,
    ("哈尔滨", "巴黎"): 7700,
    ("哈尔滨", "纽约"): 10300,
    ("哈尔滨", "柏林"): 6800,
    ("哈尔滨", "洛杉矶"): 9300,
    ("哈尔滨", "首尔"): 950,
    ("哈尔滨", "曼谷"): 4400,
    ("呼和浩特", "乌鲁木齐"): 1800,
    ("呼和浩特", "广州"): 2500,
    ("呼和浩特", "拉萨"): 1900,
    ("呼和浩特", "昆明"): 2200,
    ("呼和浩特", "成都"): 1600,
    ("呼和浩特", "上海"): 1500,
    ("呼和浩特", "南宁"): 2700,
    ("呼和浩特", "西安"): 750,
    ("呼和浩特", "合肥"): 1400,
    ("呼和浩特", "伦敦"): 7800,
    ("呼和浩特", "东京"): 2500,
    ("呼和浩特", "悉尼"): 9300,
    ("呼和浩特", "莫斯科"): 5400,
    ("呼和浩特", "巴黎"): 8000,
    ("呼和浩特", "纽约"): 10600,
    ("呼和浩特", "柏林"): 7100,
    ("呼和浩特", "洛杉矶"): 9600,
    ("呼和浩特", "首尔"): 1400,
    ("呼和浩特", "曼谷"): 3700,
    ("乌鲁木齐", "广州"): 3800,
    ("乌鲁木齐", "拉萨"): 1500,
    ("乌鲁木齐", "昆明"): 3000,
    ("乌鲁木齐", "成都"): 2400,
    ("乌鲁木齐", "上海"): 3300,
    ("乌鲁木齐", "南宁"): 4000,
    ("乌鲁木齐", "西安"): 2100,
    ("乌鲁木齐", "合肥"): 3200,
    ("乌鲁木齐", "伦敦"): 6000,
    ("乌鲁木齐", "东京"): 4300,
    ("乌鲁木齐", "悉尼"): 10500,
    ("乌鲁木齐", "莫斯科"): 3600,
    ("乌鲁木齐", "巴黎"): 6200,
    ("乌鲁木齐", "纽约"): 9800,
    ("乌鲁木齐", "柏林"): 5300,
    ("乌鲁木齐", "洛杉矶"): 8800,
    ("乌鲁木齐", "首尔"): 3200,
    ("乌鲁木齐", "曼谷"): 5500,
    ("广州", "拉萨"): 2300,
    ("广州", "昆明"): 1000,
    ("广州", "成都"): 1400,
    ("广州", "上海"): 1200,
    ("广州", "南宁"): 500,
    ("广州", "西安"): 1500,
    ("广州", "合肥"): 1100,
    ("广州", "伦敦"): 9300,
    ("广州", "东京"): 2800,
    ("广州", "悉尼"): 7500,
    ("广州", "莫斯科"): 7900,
    ("广州", "巴黎"): 9500,
    ("广州", "纽约"): 12100,
    ("广州", "柏林"): 8600,
    ("广州", "洛杉矶"): 11100,
    ("广州", "首尔"): 2000,
    ("广州", "曼谷"): 1500,
    ("拉萨", "昆明"): 1300,
    ("拉萨", "成都"): 1200,
    ("拉萨", "上海"): 3100,
    ("拉萨", "南宁"): 2000,
    ("拉萨", "西安"): 1600,
    ("拉萨", "合肥"): 2800,
    ("拉萨", "伦敦"): 7500,
    ("拉萨", "东京"): 4100,
    ("拉萨", "悉尼"): 9000,
    ("拉萨", "莫斯科"): 5100,
    ("拉萨", "巴黎"): 7700,
    ("拉萨", "纽约"): 11300,
    ("拉萨", "柏林"): 6800,
    ("拉萨", "洛杉矶"): 10300,
    ("拉萨", "首尔"): 3000,
    ("拉萨", "曼谷"): 2500,
    ("昆明", "成都"): 700,
    ("昆明", "上海"): 1900,
    ("昆明", "南宁"): 800,
    ("昆明", "西安"): 1400,
    ("昆明", "合肥"): 1600,
    ("昆明", "伦敦"): 8800,
    ("昆明", "东京"): 3300,
    ("昆明", "悉尼"): 7000,
    ("昆明", "莫斯科"): 7400,
    ("昆明", "巴黎"): 9000,
    ("昆明", "纽约"): 11600,
    ("昆明", "柏林"): 8100,
    ("昆明", "洛杉矶"): 10600,
    ("昆明", "首尔"): 2500,
    ("昆明", "曼谷"): 1000,
    ("成都", "上海"): 1700,
    ("成都", "南宁"): 1300,
    ("成都", "西安"): 700,
    ("成都", "合肥"): 1400,
    ("成都", "伦敦"): 8200,
    ("成都", "东京"): 3100,
    ("成都", "悉尼"): 8000,
    ("成都", "莫斯科"): 6800,
    ("成都", "巴黎"): 8400,
    ("成都", "纽约"): 11000,
    ("成都", "柏林"): 7500,
    ("成都", "洛杉矶"): 10000,
    ("成都", "首尔"): 2300,
    ("成都", "曼谷"): 2000,
    ("上海", "南宁"): 1700,
    ("上海", "西安"): 1200,
    ("上海", "合肥"): 400,
    ("上海", "伦敦"): 9200,
    ("上海", "东京"): 1800,
    ("上海", "悉尼"): 8000,
    ("上海", "莫斯科"): 6900,
    ("上海", "巴黎"): 9400,
    ("上海", "纽约"): 11000,
    ("上海", "柏林"): 8500,
    ("上海", "洛杉矶"): 10000,
    ("上海", "首尔"): 900,
    ("上海", "曼谷"): 2700,
    ("南宁", "西安"): 1800,
    ("南宁", "合肥"): 1500,
    ("南宁", "伦敦"): 9500,
    ("南宁", "东京"): 3300,
    ("南宁", "悉尼"): 7000,
    ("南宁", "莫斯科"): 8100,
    ("南宁", "巴黎"): 9700,
    ("南宁", "纽约"): 12300,
    ("南宁", "柏林"): 8800,
    ("南宁", "洛杉矶"): 11300,
    ("南宁", "首尔"): 2500,
    ("南宁", "曼谷"): 1000,
    ("西安", "合肥"): 900,
    ("西安", "伦敦"): 8100,
    ("西安", "东京"): 2600,
    ("西安", "悉尼"): 8500,
    ("西安", "莫斯科"): 6700,
    ("西安", "巴黎"): 8300,
    ("西安", "纽约"): 10900,
    ("西安", "柏林"): 7400,
    ("西安", "洛杉矶"): 9900,
    ("西安", "首尔"): 1800,
    ("西安", "曼谷"): 2800,
    ("合肥", "伦敦"): 8800,
    ("合肥", "东京"): 2200,
    ("合肥", "悉尼"): 8400,
    ("合肥", "莫斯科"): 6500,
    ("合肥", "巴黎"): 9000,
    ("合肥", "纽约"): 11600,
    ("合肥", "柏林"): 8100,
    ("合肥", "洛杉矶"): 10600,
    ("合肥", "首尔"): 1300,
    ("合肥", "曼谷"): 2800,
    ("伦敦", "东京"): 9500,
    ("伦敦", "悉尼"): 16900,
    ("伦敦", "莫斯科"): 2500,
    ("伦敦", "巴黎"): 350,
    ("伦敦", "纽约"): 5600,
    ("伦敦", "柏林"): 950,
    ("伦敦", "洛杉矶"): 8800,
    ("伦敦", "首尔"): 8800,
    ("伦敦", "曼谷"): 9500,
    ("东京", "悉尼"): 7800,
    ("东京", "莫斯科"): 7500,
    ("东京", "巴黎"): 9800,
    ("东京", "纽约"): 10900,
    ("东京", "柏林"): 8900,
    ("东京", "洛杉矶"): 8800,
    ("东京", "首尔"): 1200,
    ("东京", "曼谷"): 4500,
    ("悉尼", "莫斯科"): 13400,
    ("悉尼", "巴黎"): 16700,
    ("悉尼", "纽约"): 15900,
    ("悉尼", "柏林"): 16200,
    ("悉尼", "洛杉矶"): 12000,
    ("悉尼", "首尔"): 8400,
    ("悉尼", "曼谷"): 7500,
    ("莫斯科", "巴黎"): 2500,
    ("莫斯科", "纽约"): 7500,
    ("莫斯科", "柏林"): 1600,
    ("莫斯科", "洛杉矶"): 9700,
    ("莫斯科", "首尔"): 6600,
    ("莫斯科", "曼谷"): 7000,
    ("巴黎", "纽约"): 5800,
    ("巴黎", "柏林"): 900,
    ("巴黎", "洛杉矶"): 9100,
    ("巴黎", "首尔"): 9100,
    ("巴黎", "曼谷"): 9800,
    ("纽约", "柏林"): 6600,
    ("纽约", "洛杉矶"): 3900,
    ("纽约", "首尔"): 11000,
    ("纽约", "曼谷"): 13800,
    ("柏林", "洛杉矶"): 9300,
    ("柏林", "首尔"): 8200,
    ("柏林", "曼谷"): 8900,
    ("洛杉矶", "首尔"): 9500,
    ("洛杉矶", "曼谷"): 13200,
    ("首尔", "曼谷"): 3700,
}

city_to_airlines = {}
for airline, cities_served in airlines.items():
    for city in cities_served:
        if city not in city_to_airlines:
            city_to_airlines[city] = []
        city_to_airlines[city].append(airline)


def generate_flight_number(airline_code):
    return f"{airline_code}{random.randint(1000, 9999)}"


# 修改生成航班数据的函数
def generate_flight_data(cities, city_distances, city_to_airlines, airlines_code):
    flights = []

    # 随机生成航班数据  
    for _ in range(ITEM_NUM):
        dep_city = random.choice(cities)
        arr_city = random.choice(cities)
        while arr_city == dep_city:
            arr_city = random.choice(cities)

            # 获取出发城市可用的航空公司
        available_airlines = city_to_airlines.get(dep_city, [])
        if not available_airlines:  # 如果没有航空公司服务该城市，跳过  
            continue

            # 随机选择一个航空公司
        airline = random.choice(available_airlines)

        # 生成航班号  
        flight_number = generate_flight_number(airlines_code[airline])

        # 随机选择飞机型号  
        aircraft = random.choice(common_aircraft)

        # 获取两城市间的距离  
        distance = city_distances.get((dep_city, arr_city))
        if not distance:
            distance = city_distances.get((arr_city, dep_city))

        if not distance:  # 如果没有距离数据，则跳过  
            continue

            # 根据距离计算票价，假设每公里0.1元
        price = distance * 1.03

        # 假设基准飞行速度为800公里/小时  
        speed = 900  # 公里/小时  
        flight_duration = int((distance / speed) * 60)  # 转换为分钟  

        # 随机生成出发时间和到达时间  
        dep_time = base_date + timedelta(minutes=random.randint(0, 1440 - flight_duration))
        arr_time = dep_time + timedelta(minutes=flight_duration)

        # 确保到达时间不早于出发时间  
        while arr_time < dep_time:
            arr_time += timedelta(minutes=1)

            # 随机生成余座数
        seats = random.randint(2, 200)

        # 格式化时间  
        dep_time_str = dep_time.strftime('%Y-%m-%d %H:%M')
        arr_time_str = arr_time.strftime('%Y-%m-%d %H:%M')

        # 添加到航班数据列表，航空公司在第一列，航班号在第二列，飞机型号在第三列  
        flights.append(
            (airline, flight_number, aircraft, dep_city, dep_time_str, arr_city, arr_time_str, round(price, 2), seats))

    return flights


# 将航班数据写入TXT文件
def write_flights_to_file(flights, filename):
    with open(filename, 'w', encoding='utf-8') as file:
        for flight in flights:
            # 将每个元素用英文逗号隔开，并写入文件，每个航班数据占一行  
            file.write(', '.join(map(str, flight)) + '\n')



flights = generate_flight_data(cities, city_distances, city_to_airlines, airlines_code)
write_flights_to_file(flights, output_file)